app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.build(post_params)

		if @post.save!
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

	def update
		if @post.update!(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First Message now edited"], ["updated_at", "2016-03-19 17:28:22.844420"], ["id", 1]]