app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "summary", "mentor_id", "vote", "video_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["title", "e"], ["content", "e"], ["summary", "e"], ["mentor_id", 1], ["vote", 1], ["video_link", "1"], ["created_at", "2016-03-24 14:51:40.908065"], ["updated_at", "2016-03-24 14:51:40.908065"]]